## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
cloudwatch_log.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 0 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                          NAME                                           |
|----------|-----------------------------------------------------------------------------------------|
| add      | `aws_cloudwatch_log_group.route53_resolver_query_log[0]`                                |
|          | `aws_cloudwatch_log_resource_policy.route53_resolver_query_logging_policy[0]`           |
| recreate | `aws_cloudwatch_log_metric_filter.route53_nxdomain_notification[0]`                     |
|          | `aws_cloudwatch_log_metric_filter.route53_servfail_notification[0]`                     |
|          | `aws_route53_resolver_query_log_config.dns_query_log_config[0]`                         |
|          | `aws_route53_resolver_query_log_config.main[0]`                                         |
|          | `aws_route53_resolver_query_log_config_association.dns_query_log_config_association[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.route53_resolver_query_log[0] will be created
  + resource "aws_cloudwatch_log_group" "route53_resolver_query_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (sensitive value)
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
    }

  # aws_cloudwatch_log_metric_filter.route53_nxdomain_notification[0] must be replaced
-/+ resource "aws_cloudwatch_log_metric_filter" "route53_nxdomain_notification" {
      ~ id             = "Route53NXDOMAINNotificationDomain" -> (known after apply)
      ~ log_group_name = (sensitive value) # forces replacement
        name           = "Route53NXDOMAINNotificationDomain"
      ~ pattern        = "{ $.rcode = \"NXDOMAIN\" && $.query_name = \"*.staging.notification.cdssandbox.xyz\" }" -> "{ $.rcode = \"NXDOMAIN\" && $.query_name = \"*staging.notification.cdssandbox.xyz*\" && $.query_name != \"*.internal*\" }"

      ~ metric_transformation {
          - dimensions    = {} -> null
          ~ name          = "Route53DNSResolutionFailureCount" -> "Route53PublicDNSResolutionFailureCount"
          ~ namespace     = "Route53/Resolver" -> "Route53/PublicResolver"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.route53_servfail_notification[0] must be replaced
-/+ resource "aws_cloudwatch_log_metric_filter" "route53_servfail_notification" {
      ~ id             = "Route53SERVFAILNotificationDomain" -> (known after apply)
      ~ log_group_name = (sensitive value) # forces replacement
        name           = "Route53SERVFAILNotificationDomain"
      ~ pattern        = "{ $.rcode = \"SERVFAIL\" && $.query_name = \"*.staging.notification.cdssandbox.xyz\" }" -> "{ $.rcode = \"SERVFAIL\" && $.query_name = \"*staging.notification.cdssandbox.xyz*\" && $.query_name != \"*.internal*\" }"

      ~ metric_transformation {
          - dimensions    = {} -> null
          ~ name          = "Route53DNSResolutionFailureCount" -> "Route53PublicDNSResolutionFailureCount"
          ~ namespace     = "Route53/Resolver" -> "Route53/PublicResolver"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_resource_policy.route53_resolver_query_logging_policy[0] will be created
  + resource "aws_cloudwatch_log_resource_policy" "route53_resolver_query_logging_policy" {
      + id              = (known after apply)
      + policy_document = (known after apply)
      + policy_name     = "route53-resolver-query-logging-policy"
    }

  # aws_route53_resolver_query_log_config.dns_query_log_config[0] must be replaced
-/+ resource "aws_route53_resolver_query_log_config" "dns_query_log_config" {
      ~ arn             = "arn:aws:route53resolver:ca-central-1:239043911459:resolver-query-log-config/rqlc-f83a5950234b4aa2" -> (known after apply)
      ~ destination_arn = "arn:aws:logs:ca-central-1:239043911459:log-group:route53/ca-central-1/239043911459/DNS/logs" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "rqlc-f83a5950234b4aa2" -> (known after apply)
        name            = (sensitive value)
      ~ owner_id        = "239043911459" -> (known after apply)
      ~ share_status    = "NOT_SHARED" -> (known after apply)
        tags            = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_route53_resolver_query_log_config.main[0] must be replaced
-/+ resource "aws_route53_resolver_query_log_config" "main" {
      ~ arn             = "arn:aws:route53resolver:ca-central-1:239043911459:resolver-query-log-config/rqlc-94aeaf4e0b23424c" -> (known after apply)
      ~ destination_arn = "arn:aws:logs:ca-central-1:239043911459:log-group:route53/ca-central-1/239043911459/DNS/logs" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "rqlc-94aeaf4e0b23424c" -> (known after apply)
        name            = "route53-query-logging"
      ~ owner_id        = "239043911459" -> (known after apply)
      ~ share_status    = "NOT_SHARED" -> (known after apply)
        tags            = {
            "CostCenter"  = "notification-canada-ca-staging"
            "Environment" = "staging"
            "Service"     = "dns-monitoring"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_route53_resolver_query_log_config_association.dns_query_log_config_association[0] must be replaced
-/+ resource "aws_route53_resolver_query_log_config_association" "dns_query_log_config_association" {
      ~ id                           = "rqlca-a06fede5274846f2" -> (known after apply)
      ~ resolver_query_log_config_id = "rqlc-f83a5950234b4aa2" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 7 to add, 0 to change, 5 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 69 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
